/**
 * Created by Administrator on 2016/12/6.
 */
$(function () {
    var arr=["北京市","上海市","天津市","河北省","山西省","内蒙古","辽宁省","吉林省","黑龙江","江苏省","浙江省","安徽省","福建省","江西省","山东省","河南省",
        "湖北省","湖南省","广东省","广西省","海南省","重庆市","四川省","贵州省","云南省","西藏自","陕西省","甘肃省","青海省","宁夏回","新疆维","香港特","澳门特","台湾省"];
    arr["北京市"]=["北京市"];
    arr["上海市"]=["上海市"];
    arr["天津市"]=["天津市"];
    arr["河北省"]=["石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"];
    arr["山西省"]=["太原市","大同市","阳泉市","长治市","晋城市","朔州市","晋中市","运城市","忻州市","临汾市","吕梁市"];
    arr["内蒙古"]=["呼和浩市","包头市","乌海市","赤峰市","通辽市","鄂尔多斯市","呼伦贝","巴彦淖","兴安盟","锡林郭","阿拉善"];
    arr["辽宁省"]=["沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市","葫芦岛"];
    arr["吉林省"]=["长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边朝"];
    arr["黑龙江"]=["哈尔滨","齐齐哈","鹤岗市","双鸭山","鸡西市","大庆市","伊春市","牡丹江","佳木斯","七台河","黑河市","绥化市","大兴安"];
    arr["江苏省"]=["南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市"];
    arr["浙江省"]=["杭州市","宁波市","温州市","嘉兴市","湖州市","绍兴市","金华市","衢州市","舟山市","台州市","丽水市"];
    arr["安徽省"]=["合肥市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","黄山市","滁州市","阜阳市","宿州市","巢湖市","六安市",
        "亳州市","池州市","宣城市"];
    arr["福建省"]=["福州市","厦门市","莆田市","三明市","泉州市","漳州市","南平市","龙岩市","宁德市"];
    arr["江西省"]=["南昌市","景德镇","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"];
    arr["山东省"]=["济南市","青岛市","淄博市","枣庄市","东营市","烟台市","潍坊市","济宁市","泰安市","威海市","日照市","莱芜市","临沂市","德州市",
        "聊城市","滨州市","荷泽市"];
    arr["河南省"]=["郑州市","开封市","洛阳市","平顶山市","安阳市","鹤壁市","新乡市","焦作市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市",
        "信阳市","周口市"," 驻马店市"];
    arr["湖北省"]=["武汉市","黄石市","十堰市","宜昌市","襄樊市","鄂州市","荆门市","孝感市","荆州市","黄冈市","咸宁市","随州市","恩施土",
        "仙桃市","潜江市","天门市","神农架"];
    arr["湖南省"]=["长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","益阳市","郴州市","永州市","怀化市","娄底市","湘西州"];
    arr["广东省"]=["广州市","深圳市","珠海市","汕头市","韶关市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市",
        "清远市","东莞市","中山市","潮州市","揭阳市","云浮市"];
    arr["广西省"]=["南宁市","柳州市","桂林市","梧州市","北海市","防城港","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"];
    arr["海南省"]=["海口市","三亚市"];
    arr["重庆市"]=["重庆市"];
    arr["四川省"]=["成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","眉山市","宜宾市","广安市",
        "达州市","雅安市","巴中市","资阳市","阿坝藏","甘孜藏","凉山彝"];
    arr["贵州省"]=["贵阳市","六盘水市","遵义市","安顺市","铜仁地","毕节地","黔西南","黔东南","黔南布"];
    arr["云南省"]=["昆明市","曲靖市","玉溪市","保山市","昭通市","丽江市","思茅市","临沧市","楚雄彝","红河哈","文山壮","西双版纳州","大理白","德宏傣","怒江傈","迪庆藏"];
    arr["西藏自"]=["拉萨市","昌都地","山南地","日喀则","那曲地","阿里地","林芝地"];
    arr["陕西省"]=["西安市","铜川市","宝鸡市","咸阳市","渭南市","延安市","汉中市","榆林市","安康市","商洛市"];
    arr["甘肃省"]=["兰州市","金昌市","白银市","天水市","嘉峪关","武威市","张掖市","平凉市","酒泉市","庆阳市","定西市","陇南市","临夏回","甘南藏"];
    arr["青海省"]=["西宁市","海东地区","海北藏","黄南藏","海南藏","果洛藏","玉树藏","海西蒙"];
    arr["宁夏回"]=["银川市","石嘴山市","吴忠市","固原市","中卫市"];
    arr["新疆维"]=["乌鲁木","克拉玛","吐鲁番","哈密地","昌吉回","博尔塔","巴音郭","阿克苏","克孜勒",
        "喀什地","和田地","伊犁哈","塔城地","阿勒泰"];
    arr["香港特"]=["香港"];
    arr["澳门特"]=["澳门"];
    arr["台湾省"]=["台湾"];
    /*获取省和市*/
    var Province=document.getElementById("province");
    var oSpan=Province.getElementsByTagName("span");
    var City=document.getElementById("city");
    /*将所有省份渲染进去*/
    for (var i= 0;i<arr.length;i++){
        Province.innerHTML+="<span>"+arr[i]+"</span>"
    }
    /*点击省份显示当前城市*/
    for(var j=0;j<oSpan.length;j++){
        oSpan[j].onclick= function () {
            var thisI=this.innerHTML;
            City.innerHTML="";
            for(var k=0;k<arr[thisI].length;k++){
                City.innerHTML+="<span>"+arr[thisI][k]+"</span>"
            }
        };
    }
    /*默认显示湖北省的并且湖北省高亮显示*/
    for(var o=0;o<arr["湖北省"].length;o++){
        City.innerHTML+="<span>"+arr["湖北省"][o]+"</span>";
    }
    $("#province").find("span").each(function (k) {
        var pro=$("#province").find("span").eq(k).text();
        if(pro=="湖北省"){
            $("#province").find("span").eq(k).addClass("active")
        }
    });

    /*点击选择条件显示选择条件*/
    $(".choiceTjA>p").on("click", function () {
        var i=$(this).parent().index();
        if($(".type").eq(i).is(":visible")==true){
            $(".type").eq(i).fadeOut();
        }else{
            $(".type").fadeOut();
            $(".type").eq(i).fadeIn();
        }
    });

    /*点击省份高亮显示*/
    $("#province").on("click", "span",function () {
        $(this).addClass("active").siblings().removeClass("active");
    });

    /*点击城市高亮显示*/
    $("#city").on("click", "span",function () {
        var cityName=$(this).text().substring(0,4);
        $(".city").text(cityName);
        $(".city").addClass("active");
        $(this).addClass("active").siblings().removeClass("active");
    });

    $(".object>span").on("click", function () {
        var moldName=$(this).text().substring(0,4);
        $(".mold").text(moldName);
        $(".mold").addClass("active");
        $(".object>span").removeClass("active");
        $(this).addClass("active")
    });


    $(".sure").on("click", function () {
        $(".type").fadeOut()
    });

    $(".rest").on("click", function () {
        $(this).parent().prev().find("span").removeClass("active");
        $(".all").addClass("active");
        $(".type").fadeOut()
    });
})
